source/linux/server/hardware/hpe/dl360_bios_upgrade/before/sysbench_fileio
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time

Extra file open flags: (none)
128 files, 64MiB each
8GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!

File operations:
    reads/s:                      1446.84
    writes/s:                     964.56
    fsyncs/s:                     3086.64

Throughput:
    read, MiB/s:                  22.61
    written, MiB/s:               15.07

General statistics:
    total time:                          300.0293s
    total number of events:              1649469

Latency (ms):
         min:                                    0.00
         avg:                                    0.18
         max:                                   25.45
         95th percentile:                        0.86
         sum:                               298910.93

Threads fairness:
    events (avg/stddev):           1649469.0000/0.00
    execution time (avg/stddev):   298.9109/0.00